//=============================================================================
//
// スコア処理 [enemyPoint.h]
// Author : 
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
struct ENEMYPOINT
{
	XMFLOAT3	pos;
	float		width;
	float		height;
	BOOL		use;
};
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitEnemyPoint(void);
void UninitEnemyPoint(void);
void UpdateEnemyPoint(float posX, float posY, int i);
void DrawEnemyPoint(void);

ENEMYPOINT *GetEnemyPoint(void);

